Revit 2026 API

# DividedPathDisplayNodes Property

---

Controls whether the points of the divided path are visible

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool DisplayNodes { get; set; }
```
```vb
Public Property DisplayNodes As Boolean
	Get
	Set
```
```cpp
public:
property bool DisplayNodes {
	bool get ();
	void set (bool value);
}
```
```fsharp
member DisplayNodes : bool with get, set
```

#### Property Value

Boolean

If true the nodes of the divided path are visible. If false the nodes are hidden.

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace